MrToast99/Nextube-Remaster/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# Flash - 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - 8MB chip, but the original ESP32 MMU can only map 4MB at a time.
# Setting SPIRAM_SIZE to 4MB caps the driver's mapping attempt to the MMU
# limit and suppresses the "Virtual address not enough for PSRAM" warning.
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE=4194304

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Wi-Fi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# Double the TX buffer pool (default 32) so TLS handshake packets and
# concurrent HTTP responses don't compete and cause EAGAIN on sends.
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# OTA
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=10
# Disable automatic mDNS registration for the AP netif.
# By default IDF 5.x mDNS registers ALL netifs (STA, AP, ETH) automatically
# via built-in event handlers when each interface comes up.  We do our own
# explicit mdns_register_netif(s_sta_netif) in start_mdns(), so we only want
# STA registered.  With AP auto-registration enabled, any WIFI_EVENT_AP_START
# fired after mdns_init() (fallback AP, reconnect) causes mDNS to probe on the
# AP interface and announce to the LAN — producing a 1-second "espressif" blip
# on the Unifi controller (or any mDNS-aware client) on every announcement
# cycle until the probe settles.  Turning it off here ensures the AP interface
# is never presented to LAN-side mDNS resolvers.
CONFIG_MDNS_PREDEF_NETIF_AP=n

# LWIP netif default hostname.
# This controls the name the device uses in DHCP client requests (option 12)
# and is the hostname the mDNS stack reads from the netif during mdns_init().
# Without this, the netif hostname defaults to "espressif", causing the device
# to announce itself as "espressif.localdomain" on the LAN and send mDNS probes
# with "espressif" before mdns_hostname_set() (which is async) takes effect.
# The start_mdns() function also calls esp_netif_set_hostname() at runtime to
# apply the user-configured hostname from config; this default ensures the very
# first probe — fired the moment mdns_init() starts the task — is already
# correct even before that runtime call executes.
CONFIG_LWIP_LOCAL_HOSTNAME="nextube-remaster"

# TLS / HTTPS
# Enable the built-in Mozilla CA certificate bundle so esp_crt_bundle_attach()
# works in the weather HTTP client.  Without this the bundle is empty and
# esp-tls rejects the connection with "No server verification option set".
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# Partial bundle (~40 KB, 40 most common CAs) covers Let's Encrypt / DigiCert /
# GlobalSign used by wttr.in, Open-Meteo, and Met.no.  The full bundle (~70 KB,
# 150+ CAs) wastes heap and was causing HTTP server connection-slot exhaustion.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_PARTIAL=y

# LWIP
CONFIG_LWIP_MAX_SOCKETS=32
CONFIG_LWIP_SNTP_MAX_SERVERS=4

# NVS
CONFIG_NVS_ENCRYPTION=n

# ── IRAM optimisation ─────────────────────────────────────────────────
# IRAM overflows by ~5 KB when esp_jpeg + WiFi + BT all load.
# Move non-ISR-critical code to flash to free headroom.

# FreeRTOS tick hook and utility functions don't need to be in IRAM.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# We use spi_device_polling_transmit exclusively – the DMA/ISR path
# for SPI master is never exercised, so save the IRAM it would occupy.
CONFIG_SPI_MASTER_ISR_IN_IRAM=n

# Ring-buffer ISR and helper functions (used by RMT LED driver and I2S)
# can live in flash; latency is acceptable for our use case.
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y

# ── Microphone sampling ───────────────────────────────────────────────
# The mic driver uses ESP_TIMER_TASK dispatch + adc_oneshot_read().
# No ISR-safe ADC variant is needed (adc_oneshot_read_isr is not available
# on the original ESP32 in IDF 5.x), and no IRAM placement is required.
# ESP_TIMER_TASK callbacks run in the esp_timer service task (priority 22),
# where the normal mutex-based adc_oneshot_read() is perfectly safe.
# The esp_timer service task stack is bumped to 8 KB (default 4 KB) because
# adc_oneshot_read() → ADC HAL → ADC LL → hardware-access helpers adds ~3 KB
# of call-chain depth on top of the task's own frame; the default 4 KB was
# occasionally tight under production conditions when both WiFi events and
# the timer callback fire concurrently on Core 0.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192

